---
title: ElectricalAnalyticalLoadSet
classe: Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ElectricalAnalyticalLoadSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 QuantityOnStandBy { get; set; }` | `electricalAnalyticalLoadSet.QuantityOnStandBy` | Int32 |
| `Int32 TotalQuantity { get; }` | `electricalAnalyticalLoadSet.TotalQuantity` | Int32 |
| `ElectricalAnalyticalLoadSet Create(Document, String)` | `ElectricalAnalyticalLoadSet.Create(document, name)` | ElectricalAnalyticalLoadSet |
| `ISet<ElementId> GetLoadIds()` | `electricalAnalyticalLoadSet.GetLoadIds()` | ISet<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```